#==============================================================================
# ** Dungeons and Dragons
#------------------------------------------------------------------------------
#  Config: Item and features sets
#==============================================================================
module DND
  
  ELEMENT_NAME = [
    "無",
    "鈍擊",
    "穿刺",
    "揮砍",
    "酸",
    "寒冷",
    "火焰",
    "能量",
    "閃電",
    "壞死",
    "毒",
    "精神",
    "聖光",
    "閃電",
    
  ]
  
  PARAM_NAME  = [
    "無",
    "能量值",
    "力量",
    "體質",
    "智力",
    "智慧",
    "敏捷",
    "智慧",
  ]
  
  WEAPON_TYPE_NAME = [
    "",
    "蹄斧",
    "馬蹄",
    "棍棒",
    "單蹄劍",
    "雙蹄劍",
    "弓",
    "弩",
    "戰錘",
    "釘頭錘",
    "熱武器",
    "箭矢",
    "弩矢",
    "子彈",
    "法杖"
  ]
 
  
  ARMOR_TYPE_NAME = [
  "",
  "輕甲",
  "中甲",
  "重甲",
  "衣服",
  "盾牌",
  "大盾",
  "蹄靴",
  "腰帶",
  "項鍊",
  "斗篷",
  "戒指",
  "護腿",
  "符文",
  "寶石",
  ]
  
  Race  = [
    "Earth Pony",
    "Unicorn",
    "Pegasus",
    "Dragon",
    "Woodlands",
    "Deer",
    "Manticore",
  ]
  
end
